var gzs = [
    {
        "name": "台江县",
        "lgtd": 108.31,
        "lttd": 26.63
    },
    {
        "name": "桐梓县",
        "lgtd": 106.86,
        "lttd": 28.42
    },
    {
        "name": "荔波县",
        "lgtd": 107.96,
        "lttd": 25.38
    },
    {
        "name": "镇远县",
        "lgtd": 108.52,
        "lttd": 27.08
    },
    {
        "name": "紫云苗族布依族自治县",
        "lgtd": 106.2,
        "lttd": 25.7
    },
    {
        "name": "兴仁县",
        "lgtd": 105.23,
        "lttd": 25.53
    },
    {
        "name": "盘县",
        "lgtd": 104.64,
        "lttd": 25.81
    },
    {
        "name": "从江县",
        "lgtd": 108.71,
        "lttd": 25.68
    },
    {
        "name": "松桃苗族自治县",
        "lgtd": 108.99,
        "lttd": 28.17
    },
    {
        "name": "织金县",
        "lgtd": 105.75,
        "lttd": 26.66
    },
    {
        "name": "麻江县",
        "lgtd": 107.6,
        "lttd": 26.45
    },
    {
        "name": "纳雍县",
        "lgtd": 105.28,
        "lttd": 26.8
    },
    {
        "name": "金沙县",
        "lgtd": 106.26,
        "lttd": 27.43
    },
    {
        "name": "三穗县",
        "lgtd": 108.8,
        "lttd": 26.93
    },
    {
        "name": "汇川区",
        "lgtd": 106.97,
        "lttd": 27.88
    },
    {
        "name": "安龙县",
        "lgtd": 105.33,
        "lttd": 25.15
    },
    {
        "name": "岑巩县",
        "lgtd": 108.69,
        "lttd": 27.35
    },
    {
        "name": "镇宁布依族苗族自治县",
        "lgtd": 105.63,
        "lttd": 25.8
    },
    {
        "name": "务川仡佬族苗族自治县",
        "lgtd": 107.91,
        "lttd": 28.63
    },
    {
        "name": "湄潭县",
        "lgtd": 107.47,
        "lttd": 27.79
    },
    {
        "name": "观山湖区",
        "lgtd": 106.6,
        "lttd": 26.64
    },
    {
        "name": "丹寨县",
        "lgtd": 107.93,
        "lttd": 26.25
    },
    {
        "name": "黔西县",
        "lgtd": 106.12,
        "lttd": 27.05
    },
    {
        "name": "凯里市",
        "lgtd": 107.94,
        "lttd": 26.6
    },
    {
        "name": "南明区",
        "lgtd": 106.74,
        "lttd": 26.51
    },
    {
        "name": "威宁彝族回族苗族自治县",
        "lgtd": 104.18,
        "lttd": 26.98
    },
    {
        "name": "施秉县",
        "lgtd": 108.18,
        "lttd": 27.05
    },
    {
        "name": "兴义市",
        "lgtd": 104.85,
        "lttd": 25
    },
    {
        "name": "罗甸县",
        "lgtd": 106.73,
        "lttd": 25.41
    },
    {
        "name": "石阡县",
        "lgtd": 108.15,
        "lttd": 27.5
    },
    {
        "name": "惠水县",
        "lgtd": 106.74,
        "lttd": 25.99
    },
    {
        "name": "赤水市",
        "lgtd": 105.92,
        "lttd": 28.52
    },
    {
        "name": "绥阳县",
        "lgtd": 107.24,
        "lttd": 28.16
    },
    {
        "name": "乌当区",
        "lgtd": 106.89,
        "lttd": 26.73
    },
    {
        "name": "雷山县",
        "lgtd": 108.13,
        "lttd": 26.3
    },
    {
        "name": "平坝区",
        "lgtd": 106.18,
        "lttd": 26.44
    },
    {
        "name": "大方县",
        "lgtd": 105.7,
        "lttd": 27.22
    },
    {
        "name": "福泉市",
        "lgtd": 107.5,
        "lttd": 26.79
    },
    {
        "name": "播州区",
        "lgtd": 106.86,
        "lttd": 27.63
    },
    {
        "name": "册亨县",
        "lgtd": 105.82,
        "lttd": 24.97
    },
    {
        "name": "玉屏侗族自治县",
        "lgtd": 108.98,
        "lttd": 27.33
    },
    {
        "name": "普安县",
        "lgtd": 105,
        "lttd": 25.74
    },
    {
        "name": "正安县",
        "lgtd": 107.39,
        "lttd": 28.5
    },
    {
        "name": "思南县",
        "lgtd": 108.17,
        "lttd": 27.84
    },
    {
        "name": "普定县",
        "lgtd": 105.73,
        "lttd": 26.34
    },
    {
        "name": "都匀市",
        "lgtd": 107.45,
        "lttd": 26.14
    },
    {
        "name": "水城县",
        "lgtd": 104.91,
        "lttd": 26.49
    },
    {
        "name": "息烽县",
        "lgtd": 106.67,
        "lttd": 27.15
    },
    {
        "name": "锦屏县",
        "lgtd": 109.11,
        "lttd": 26.58
    },
    {
        "name": "云岩区",
        "lgtd": 106.71,
        "lttd": 26.63
    },
    {
        "name": "习水县",
        "lgtd": 106.29,
        "lttd": 28.47
    },
    {
        "name": "黄平县",
        "lgtd": 107.9,
        "lttd": 26.99
    },
    {
        "name": "仁怀市",
        "lgtd": 106.3,
        "lttd": 27.87
    },
    {
        "name": "贞丰县",
        "lgtd": 105.67,
        "lttd": 25.42
    },
    {
        "name": "余庆县",
        "lgtd": 107.73,
        "lttd": 27.41
    },
    {
        "name": "长顺县",
        "lgtd": 106.42,
        "lttd": 25.97
    },
    {
        "name": "沿河土家族自治县",
        "lgtd": 108.35,
        "lttd": 28.65
    },
    {
        "name": "凤冈县",
        "lgtd": 107.74,
        "lttd": 27.95
    },
    {
        "name": "白云区",
        "lgtd": 106.67,
        "lttd": 26.74
    },
    {
        "name": "黎平县",
        "lgtd": 109.07,
        "lttd": 26.12
    },
    {
        "name": "清镇市",
        "lgtd": 106.33,
        "lttd": 26.68
    },
    {
        "name": "赫章县",
        "lgtd": 104.6,
        "lttd": 27.12
    },
    {
        "name": "剑河县",
        "lgtd": 108.67,
        "lttd": 26.64
    },
    {
        "name": "钟山区",
        "lgtd": 104.85,
        "lttd": 26.65
    },
    {
        "name": "独山县",
        "lgtd": 107.57,
        "lttd": 25.62
    },
    {
        "name": "瓮安县",
        "lgtd": 107.42,
        "lttd": 27.19
    },
    {
        "name": "平塘县",
        "lgtd": 107.06,
        "lttd": 25.81
    },
    {
        "name": "江口县",
        "lgtd": 108.8,
        "lttd": 27.72
    },
    {
        "name": "西秀区",
        "lgtd": 106.05,
        "lttd": 26.2
    },
    {
        "name": "三都水族自治县",
        "lgtd": 107.95,
        "lttd": 25.85
    },
    {
        "name": "德江县",
        "lgtd": 108.1,
        "lttd": 28.32
    },
    {
        "name": "修文县",
        "lgtd": 106.62,
        "lttd": 26.98
    },
    {
        "name": "贵定县",
        "lgtd": 107.18,
        "lttd": 26.43
    },
    {
        "name": "六枝特区",
        "lgtd": 105.42,
        "lttd": 26.26
    },

    {
        "name": "天柱县",
        "lgtd": 109.24,
        "lttd": 26.93
    },
    {
        "name": "红花岗区",
        "lgtd": 106.92,
        "lttd": 27.68
    },
    {
        "name": "望谟县",
        "lgtd": 106.18,
        "lttd": 25.26
    },
    {
        "name": "万山区",
        "lgtd": 109.26,
        "lttd": 27.52
    },
    {
        "name": "晴隆县",
        "lgtd": 105.22,
        "lttd": 25.87
    },
    {
        "name": "道真仡佬族苗族自治县",
        "lgtd": 107.61,
        "lttd": 28.92
    },
    {
        "name": "印江土家族苗族自治县",
        "lgtd": 108.55,
        "lttd": 27.97
    },
    {
        "name": "龙里县",
        "lgtd": 107,
        "lttd": 26.5
    },
    {
        "name": "榕江县",
        "lgtd": 108.41,
        "lttd": 26.04
    },
    {
        "name": "花溪区",
        "lgtd": 106.68,
        "lttd": 26.38
    },
    {
        "name": "开阳县",
        "lgtd": 107.01,
        "lttd": 27.07
    },
    {
        "name": "七星关区",
        "lgtd": 105.284852,
        "lttd": 27.302085
    }
];
var geoCoordMap = {};
for(var i=0;i<gzs.length;i++){
    geoCoordMap[gzs[i].name] = [gzs[i].lgtd,gzs[i].lttd]
}
console.log(JSON.stringify(geoCoordMap));